
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsights
* Update
  * azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY
  * azurerm_key_vault_secret.AZURE_KEY_VAULT_SECRET
  * azurerm_key_vault_secret.update-summary-tab-cron
  * module.fpl-action-group.azurerm_resource_group_template_deployment.action-group
* Delete
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "fpl-case-service-appinsights-aat"
      + resource_group_name                   = "fpl-case-service-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "family-public-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fpla-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Family Public Law"
        }
    }

  # azurerm_key_vault_secret.AZURE_APPINSGHTS_KEY will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSGHTS_KEY" {
        id                      = "https://fpl-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/a771525c377349a98785c2d96a6b3acc"
        name                    = "AppInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.AZURE_KEY_VAULT_SECRET will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_KEY_VAULT_SECRET" {
        id                      = "https://fpl-aat.vault.azure.net/secrets/app-insights-connection-string/6fc9e7b387cf459b91c7916848117ba8"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update-summary-tab-cron will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update-summary-tab-cron" {
        id                      = "https://fpl-aat.vault.azure.net/secrets/update-summary-tab-cron/610e9d1fb33f446c9b8ee86a6a49b90b"
        name                    = "update-summary-tab-cron"
      - not_before_date         = "2023-11-22T08:32:40Z" -> null
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be destroyed
  # (because azurerm_application_insights.this is not in configuration)
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "aba551ce-87b5-4632-a8b9-f3d07a298fba" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 50 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Insights/components/fpl-case-service-appinsights-aat" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "westeurope" -> null
      - name                                  = "fpl-case-service-appinsights-aat" -> null
      - resource_group_name                   = "fpl-case-service-aat" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"         = "family-public-law"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/fpl-ccd-configuration.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#fpla-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Family Public Law"
        } -> null
      - workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
    }

  # module.fpl-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.Resources/deployments/fpl-support"
        name                = "fpl-support"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":5067,"Program":"tfcmt","SHA1":"","Vars":{}} -->